/****************************************************/
/*Практична робота №2 Завдання №2 * /
/*Обчислення суми ряду * /
/****************************************************/
#include <stdio.h>
#include <math.h>
#include <locale.h>
int main(void) {
	setlocale(LC_ALL, "Ukr");
	long n; /* параметр ряду */
	double dbln; /* параметр ряду в формі з плаваючою точкою */
	double sum = 0; /* сума членів ряду */
	double term; /* значення поточного члена */
	const double eps = 0.000001; /* межа точності */
	long k2 = 1; /* pow ( 2 , n ) */
	short k1 = 1; /* pow (-1 , n ) */
	/* Основний цикл ; в модифікаціях обчислюються наступні значення pow ( 2 , n ) і pow (-1 , n ) */
	for (n = 0; ; n++, k2 *= 2, k1 = -k1) {
		/*Перетворення n у форму з плаваючою точкою*/
			dbln = n;
		/*Обчислення чергового члена */
			term = k1 * (dbln + 1) / (dbln * dbln + k2);
		/*Перевірка досягнення межі точності */
			if (fabs(term) >= eps)
			{
				/*Якщо не досягнута - накопичення суми */
				sum += term;
				/*Якщо досягнута - вихід з циклу */
			}
			else
			{
				break;
			}
		/*Якщо 10 членів - висновок суми */
			if (n == 9)
			{
				printf_s(" Сума 10 членів ряду = % 10.7lf \ n ", sum);
			}
	}
	/*Кінець основного циклу */
	/*Вивід остаточної суми */
	printf_s(" Повна сума ряду = %10.7lf \ n ", sum);
	return 0;
} /*Кінець програми */