/****************************************************/
/*Практична робота №2 Завдання №1 */
/*Умовний оператор */
/****************************************************/
#include <stdio.h>
#include <locale.h>
int main(void) {
	setlocale(LC_ALL, "Ukr");
	double x, y; /* координати точки */
	/* Введення координат */
	printf_s("Введіть координату x > ");
	scanf_s("%lf", &x);
	printf_s("Введіть координату y > ");
	scanf_s("%lf", &y);
	/*Вивід щойно введених значень */
	printf_s(" x = % 6.3lf ; y = % 6.3lf \n ", x, y);
	/*Перевірка умов */
	if ((y >= 1 - x) && (x * x + y * y <= 1)) printf_s("Точка потрапляє в область \n ");
	else printf_s(" Точка не потрапляє в область \n ");
	return 0;
}
