/****************************************************/
/*Практична робота №2*/
/*Обчислення значень періодичної функції */
/*Приклад виконання.Варіант № . */
/****************************************************/
# include <stdio.h>
# include <math.h>
# include <locale.h>
int main(void) {
	setlocale(LC_ALL, "Ukr");
	short n; /*параметр зовнішнього циклу */
		double x, y; /*абсциса і ордината графіка */
		short h; /*позиція точки на екрані */
		/*Зовнішній цикл - для 5 періодів */
		for (n = 0; n < 5; n++) {
			/*Вивід заголовка таблиці */
				printf(" | x | y | \n ");
			printf(" | ------- | ------------ | \n ");
			/*Внутрішній цикл для одного періоду*/
				for (x = 0; x < 4; x += 0.25) {
					/*1 - й відрізок */
						if (x < 1) y = 2 * x - 1;
					/*2 - й відрізок  */
						else if (x < 3) y = 1 - sqrt(1 - (x - 2) * (x - 2));
					/*3 - й відрізок */
						else y = 7 - 2 * x;
					/*Вивід рядка таблиці */
						printf(" | %5.2lf | %10.7lf | ", x + n * 4, y);
					/*Визначення позиції точки */
						h = (y + 1) * 10;
						if (y - 1 - h * 10 > 0.5) {
							h++;
						}
					/*Виведення точки графіка */
						for (; h > 0; h--) printf_s(" ");
					printf_s("\n");
				} /*Кінець внутрішнього циклу */
					/*Пауза до команди оператора */
					printf_s(" Натисніть клавішу Enter ...");
				getchar();
		} /*Кінець зовнішнього циклу*/
	return 0;
} /*Кінець програми */